src/cf/InformationRegisters/ДействияПриПолученииДанныхОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДействияПриПолученииДанныхОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Загружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КакЗагружать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыДействийПриПолученииДанныхОбмена</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УстанавливатьСоответствия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтратегияПоискаПоКлючам</Name>
					<Comment>Может принимать значения "Оптимально" или "Стандарт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗначенияУстановленыАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновленияСтратегииПоиска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиОбменаДаннымиXDTO.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОбменаДаннымиXDTO</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Настройки</Name>
					<Comment>Структура настроек отправки и получения данных в этой информационной базе</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкиКорреспондента</Name>
					<Comment>Структура настроек отправки и получения данных в базе-корреспонденте</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПропускатьОбъектыСОшибкамиПроверкиПоСхеме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасширениеФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИмяПланаОбменаКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешНастроек</Name>
					<Comment>Контрольная сумма Настроек</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПубличныеИдентификаторыСинхронизируемыхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПубличныеИдентификаторыСинхронизируемыхОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаВнешняяНавигационная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВариантыДействийПриПолученииДанныхОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыДействийПриПолученииДанныхОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПослеПодтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Помощником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУстанавливать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ИдентификаторыОбъектовМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ИдентификаторыОбъектовМетаданных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядокКоллекции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Comment>Например, "ОбъектыАдресацииЗадач"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Comment>Например, "ПланВидовХарактеристик.ОбъектыАдресацииЗадач"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйСиноним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПустойСсылки</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбъектаМетаданных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоваяСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ДействияПриПолученииДанныхОбмена/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область БазовыеМетодыЗаписи

// Конструктор данных новой записи регистра
// 
// Возвращаемое значение:
//  Структура - содержит:
// * УзелПланаОбмена                  - ПланОбменаСсылкаИмяПланаОбмена, Неопределено - узел плана обмена, для которого
//                                                                                     выполняется запись.
// * ОбъектМетаданных                 - СправочникСсылка.ИдентификаторыОбъектовМетаданных, Неопределено - объект
//     метаданных, чья настройка записывается
// * Загружать                        - Булево - признак того что загрузка объекта доступна
// * КакЗагружать                     - ПеречислениеСсылка.ВариантыДействийПриПолученииДанныхОбмена - как будут
//     загружаться объекты
// * УстанавливатьСоответствия        - ПеречислениеСсылка.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных - 
//     требуется ли установка соответствий
// * ЗначенияУстановленыАвтоматически - Булево - признак того, что значения настройки были установлены автоматически
// * Комментарий                      - Строка - произвольный комментарий
// * СтратегияПоискаПоКлючам          - Строка - идентификатор стратегии поиска.
// * ДатаОбновленияСтратегииПоиска    - Дата, Неопределено - дата определения стратегии поиска.
//
Функция НовыйДанныеЗаписиРегистра() Экспорт
	
	ДанныеЗаписиРегистра = Новый Структура;
	
	ДанныеЗаписиРегистра.Вставить("УзелПланаОбмена",                  Неопределено);
	ДанныеЗаписиРегистра.Вставить("ОбъектМетаданных",                 Неопределено);
	ДанныеЗаписиРегистра.Вставить("Загружать",                        Ложь);
	ДанныеЗаписиРегистра.Вставить("КакЗагружать",                     ПредопределенноеЗначение("Перечисление.ВариантыДействийПриПолученииДанныхОбмена.ПустаяСсылка"));
	ДанныеЗаписиРегистра.Вставить("УстанавливатьСоответствия",        ПредопределенноеЗначение("Перечисление.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных.ПустаяСсылка"));
	ДанныеЗаписиРегистра.Вставить("ЗначенияУстановленыАвтоматически", Ложь);
	ДанныеЗаписиРегистра.Вставить("Комментарий",                      "");
	
	ДанныеЗаписиРегистра.Вставить("СтратегияПоискаПоКлючам", "");
	ДанныеЗаписиРегистра.Вставить("ДатаОбновленияСтратегииПоиска", Неопределено);
	
	Возврат ДанныеЗаписиРегистра;
	
КонецФункции

// Конструктор данных изменяемой записи регистра
// 
// Возвращаемое значение:
//  Структура - содержит:
// * УзелПланаОбмена                  - ПланОбменаСсылкаИмяПланаОбмена, Неопределено - узел плана обмена, для которого
//                                                                                     выполняется запись.
// * ОбъектМетаданных                 - СправочникСсылка.ИдентификаторыОбъектовМетаданных, Неопределено - объект
//     метаданных, чья настройка записывается
// * Загружать                        - Булево, Неопределено - признак того что загрузка объекта доступна
// * КакЗагружать                     - ПеречислениеСсылка.ВариантыДействийПриПолученииДанныхОбмена, Неопределено - как
//     будут загружаться объекты
// * УстанавливатьСоответствия        - ПеречислениеСсылка.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных,
//     Неопределено - требуется ли установка соответствий
// * ЗначенияУстановленыАвтоматически - Булево, Неопределено - признак того, что значения настройки были установлены автоматически
// * Комментарий                      - Строка, Неопределено - произвольный комментарий
// * СтратегияПоискаПоКлючам          - Строка, Неопределено - идентификатор стратегии поиска.
// * ДатаОбновленияСтратегииПоиска    - Дата, Неопределено - дата определения стратегии поиска.
//
Функция НовыйДанныеИзмененияЗаписиРегистра() Экспорт
	
	ДанныеЗаписиРегистра = Новый Структура;
	
	ДанныеЗаписиРегистра.Вставить("УзелПланаОбмена",                  Неопределено);
	ДанныеЗаписиРегистра.Вставить("ОбъектМетаданных",                 Неопределено);
	ДанныеЗаписиРегистра.Вставить("Загружать",                        Неопределено);
	ДанныеЗаписиРегистра.Вставить("КакЗагружать",                     Неопределено);
	ДанныеЗаписиРегистра.Вставить("УстанавливатьСоответствия",        Неопределено);
	ДанныеЗаписиРегистра.Вставить("ЗначенияУстановленыАвтоматически", Неопределено);
	ДанныеЗаписиРегистра.Вставить("Комментарий",                      Неопределено);
	
	ДанныеЗаписиРегистра.Вставить("СтратегияПоискаПоКлючам",          Неопределено);
	ДанныеЗаписиРегистра.Вставить("ДатаОбновленияСтратегииПоиска",    Неопределено);
	
	Возврат ДанныеЗаписиРегистра;
	
КонецФункции

// Изменяет запись регистра.
// 
// Параметры:
//  ДанныеЗаписи - см. НовыйДанныеИзмененияЗаписиРегистра
//
Процедура ИзменитьЗаписьРегистра(ДанныеЗаписи) Экспорт
	
	ДанныеРегистра = НаборИЗаписьРегистра(ДанныеЗаписи);
	
	Для Каждого КлючИЗначение Из ДанныеЗаписи Цикл
		
		Если КлючИЗначение.Значение <> Неопределено Тогда
			
			ДанныеРегистра.ЗаписьНабора[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеРегистра.НаборЗаписей.Записать();
	
КонецПроцедуры

// Блокирует запись регистра для дальнейшего изменения.
// 
// Параметры:
//  УзелПланаОбмена  - ПланОбменаСсылкаИмяПланаОбмена- узел плана обмена, для которого определены действия.
//  ОбъектМетаданных - СправочникСсылка.ИдентификаторыОбъектовМетаданных - объект метаданных, чья настройка записывается
//
Процедура ЗаблокироватьЗаписьРегистра(УзелПланаОбмена, ОбъектМетаданных) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДействияПриПолученииДанныхОбмена");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки.УстановитьЗначение("УзелПланаОбмена",  УзелПланаОбмена);
	ЭлементБлокировки.УстановитьЗначение("ОбъектМетаданных", ОбъектМетаданных);
	
	// @skip-warning
	Блокировка.Заблокировать();
	
КонецПроцедуры

// Выполняет запись в регистр.
// 
// Параметры:
//  ДанныеЗаписи - см. НовыйДанныеЗаписиРегистра
//
Процедура ЗаписатьДанные(ДанныеЗаписи) Экспорт
	
	ДанныеРегистра = НаборИЗаписьРегистра(ДанныеЗаписи);
	
	ЗаполнитьЗначенияСвойств(ДанныеРегистра.ЗаписьНабора, ДанныеЗаписи);
	
	ДанныеРегистра.НаборЗаписей.Записать();
	
КонецПроцедуры

// Удаляет запись регистра.
// 
// Параметры:
//  ДанныеЗаписи - см. НовыйДанныеЗаписиРегистра
//
Процедура УдалитьЗаписьРегистра(ДанныеЗаписи) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.УзелПланаОбмена.Установить(ДанныеЗаписи.УзелПланаОбмена);
	НаборЗаписей.Отбор.ОбъектМетаданных.Установить(ДанныеЗаписи.ОбъектМетаданных);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ПолучениеДанных

// Получает действия обмена для объекта метаданных
// 
// Параметры:
//  УзелПланаОбмена  - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, для которого определяются действия при получении.
//  ОбъектМетаданных - ОбъектМетаданных, Строка       - объект метаданных для которого получаются действия, может быть
//                                                      указан в виде полного имени.
// 
// Возвращаемое значение:
//  Неопределено, Структура - содержит:
//  * Загружать                   - Булево
//                                  - признак того что загрузка объекта доступна.
//  * КакЗагружать                - ПеречислениеСсылка.ВариантыДействийПриПолученииДанныхОбмена, Неопределено - 
//                                   как загружать новые объекты данного типа
//  * УстанавливатьСоответствия   - ПеречислениеСсылка.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных
//                                - Неопределено - требуется ли установка соответствия
//  * СтратегияПоискаПоКлючам     - Строка - вариант стратегии поиска объектов по ключевым свойствам
//
Функция ДействияПриПолученииДанныхОбменаДляОбъекта(УзелПланаОбмена, ОбъектМетаданных) Экспорт
	
	РезультатПолученияДействий = ДействияОбмена(УзелПланаОбмена);
	
	Если Не РезультатПолученияДействий.Успешно Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	НастройкиПолучения = РезультатПолученияДействий.НастройкиПолучения;
	
	Если ТипЗнч(ОбъектМетаданных) = Тип("Строка") Тогда
		ПолноеИмя = ОбъектМетаданных;
	Иначе
		ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
	КонецЕсли;
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("ПолноеИмя", ПолноеИмя);
	НайденныеСтроки = НастройкиПолучения.НайтиСтроки(ПараметрыПоиска);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		Загружать = НайденныеСтроки[0].Загружать;
		
		ДействияПриПолучении = Новый Структура;
		ДействияПриПолучении.Вставить("Загружать",                 Загружать);
		ДействияПриПолучении.Вставить("КакЗагружать",              ?(Загружать, НайденныеСтроки[0].КакЗагружать, Неопределено));
		ДействияПриПолучении.Вставить("УстанавливатьСоответствия", ?(Загружать, НайденныеСтроки[0].УстанавливатьСоответствия, Неопределено));
		ДействияПриПолучении.Вставить("СтратегияПоискаПоКлючам",   НайденныеСтроки[0].СтратегияПоискаПоКлючам);
		
		Возврат ДействияПриПолучении;
		
	КонецЕсли;
	
КонецФункции

// Получает доступные к загрузке объекты метаданных.
// 
// Параметры:
//  УзелПланаОбмена - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, для которого определяются доступные к загрузке
//                                                     объекты метаданных.
// 
// Возвращаемое значение:
//  Структура - содержит:
// * Успешно           - Булево - признак того, что поддерживаемые объекты формата определены успешно
// * ТекстОшибки       - Строка - текст ошибки, если она возникла при получении
// * УзелПланаОбмена   - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, для которого определяются доступные к
//                                                        загрузке объекты метаданных.
// * ДоступныеОбъекты  - Неопределено, ТаблицаЗначений   - см. ТаблицаДоступныхКЗагрузкеОбъектовМетаданных 
//
Функция ДоступныеДляПолученияОбъектыМетаданных(УзелПланаОбмена) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно",          Ложь);
	Результат.Вставить("ТекстОшибки",      "");
	Результат.Вставить("ДоступныеОбъекты", Неопределено);
	Результат.Вставить("УзелПланаОбмена",  УзелПланаОбмена);
	
	РезультатОпределенияПоддерживаемыхОбъектов = ПоддерживаемыеОбъектыФормата(УзелПланаОбмена);
	
	Если Не РезультатОпределенияПоддерживаемыхОбъектов.Успешно Тогда
		
		Результат.ТекстОшибки = РезультатОпределенияПоддерживаемыхОбъектов.ТекстОшибки;
		Возврат Результат;
		
	КонецЕсли;
	
	Результат.ДоступныеОбъекты = ТаблицаДоступныхКЗагрузкеОбъектовМетаданных(РезультатОпределенияПоддерживаемыхОбъектов.ПоддерживаемыеОбъекты,
	                                                                         УзелПланаОбмена);
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

// Возвращает настройки действий при получении для узла плана обмена
// 
// Параметры:
//  УзелПланаОбмена - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, для которого получаются настройки. 
// 
// Возвращаемое значение:
//  Структура - Настройки получения объектов метаданных:
// * Успешно           - Булево - признак того, что получение настроек было выполнено успешно
// * ТекстОшибки       - Строка - текст ошибки, если она возникла при получении 
// * НастройкиПолучения - Неопределено, ТаблицаЗначений - см.ТаблицаНастроекПолученияДанных
// * УзелПланаОбмена   - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, для которого были получены настройки.
// 
Функция НастройкиПолученияОбъектовМетаданных(УзелПланаОбмена) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно",           Ложь);
	Результат.Вставить("ТекстОшибки",       "");
	Результат.Вставить("НастройкиПолучения", Неопределено);
	Результат.Вставить("УзелПланаОбмена", УзелПланаОбмена);
	
	РезультатОпределенияПоддерживаемыхОбъектов = ОбменДаннымиПовтИсп.ПоддерживаемыеОбъектыФормата(УзелПланаОбмена);
	
	Если Не РезультатОпределенияПоддерживаемыхОбъектов.Успешно Тогда
		
		Результат.ТекстОшибки = РезультатОпределенияПоддерживаемыхОбъектов.ТекстОшибки;
		Возврат Результат;
		
	КонецЕсли;
	
	РезультатОпределенияДоступныхОбъектов = ОбменДаннымиПовтИсп.ДоступныеДляПолученияОбъектыМетаданных(УзелПланаОбмена);
	Если Не РезультатОпределенияДоступныхОбъектов.Успешно Тогда
		
		Результат.ТекстОшибки = РезультатОпределенияДоступныхОбъектов.ТекстОшибки;
		Возврат Результат;
		
	КонецЕсли;
	
	Результат.НастройкиПолучения = ТаблицаНастроекПолученияДанных(РезультатОпределенияДоступныхОбъектов.ДоступныеОбъекты, УзелПланаОбмена);
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

// Определяет объекты формата, которые отправляет база корреспондент и может загружать текущая база
// 
// Параметры:
// УзелПланаОбмена  - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, для которого определяются объекты формата.
// 
// Возвращаемое значение:
//  Структура - содержит:
// * Успешно - Булево - признак того что поддерживаемые объекты формата определены успешно
// * ТекстОшибки - Строка - текст ошибки, если она возникла при получении
// * ПоддерживаемыеОбъекты - Соответствие из КлючИЗначение - состоит из:
//   ** Ключ - Строка - Имя объекта формат
//   ** Значение - Массив Из Строка - Имя объекта формат
//
Функция ПоддерживаемыеОбъектыФормата(УзелПланаОбмена) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно",               Ложь);
	Результат.Вставить("ТекстОшибки",           "");
	Результат.Вставить("ПоддерживаемыеОбъекты", Новый Соответствие);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	НастройкиОбменаДаннымиXDTO.УзелИнформационнойБазы  КАК УзелИнформационнойБазы,
	|	НастройкиОбменаДаннымиXDTO.Настройки               КАК Настройки,
	|	НастройкиОбменаДаннымиXDTO.НастройкиКорреспондента КАК НастройкиКорреспондента
	|ИЗ
	|	РегистрСведений.НастройкиОбменаДаннымиXDTO КАК НастройкиОбменаДаннымиXDTO
	|ГДЕ
	|	НастройкиОбменаДаннымиXDTO.УзелИнформационнойБазы = &УзелИнформационнойБазы";
	
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", УзелПланаОбмена);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		
		Результат.ТекстОшибки = НСтр("ru = 'Не удалось получить настройки обмена данными XDTO'");
		Возврат Результат;
	
	КонецЕсли;
	
	НастройкиЭтойБазы           = Выборка.Настройки.Получить();
	НастройкиБазыКорреспондента = Выборка.НастройкиКорреспондента.Получить();
	
	Если НастройкиЭтойБазы = Неопределено Тогда
		
		Результат.ТекстОшибки = НСтр("ru = 'Данные о поддерживаемых объектах текущего приложения и приложения-корреспондента отсутствуют.'");
		Возврат Результат;
		
	КонецЕсли;
	
	Если НастройкиЭтойБазы <> Неопределено 
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НастройкиЭтойБазы, "ПоддерживаемыеОбъекты") Тогда
		
		Если ЕстьКолонкиТаблицыБезОписанияТипов(НастройкиЭтойБазы.ПоддерживаемыеОбъекты) Тогда
			
			ПоддерживаемыеОбъектыЭтойБазы = ТаблицаПоддерживаемыхОбъектовФорматаСТипами(НастройкиЭтойБазы.ПоддерживаемыеОбъекты);
			
		Иначе
			
			ПоддерживаемыеОбъектыЭтойБазы = НастройкиЭтойБазы.ПоддерживаемыеОбъекты;
			
		КонецЕсли;
		
	Иначе
		
		Результат.ТекстОшибки = НСтр("ru = 'Для текущей информационной базы не заданы поддерживаемые объекты'");
		Возврат Результат;
		
	КонецЕсли;
	
	Если НастройкиБазыКорреспондента <> Неопределено
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НастройкиБазыКорреспондента, "ПоддерживаемыеОбъекты") Тогда
		
		Если ЕстьКолонкиТаблицыБезОписанияТипов(НастройкиБазыКорреспондента.ПоддерживаемыеОбъекты) Тогда
			
			ПоддерживаемыеОбъектыБазыКорреспондента = ТаблицаПоддерживаемыхОбъектовФорматаСТипами(НастройкиБазыКорреспондента.ПоддерживаемыеОбъекты);
			
		Иначе
			
			ПоддерживаемыеОбъектыБазыКорреспондента = НастройкиБазыКорреспондента.ПоддерживаемыеОбъекты;
			
		КонецЕсли;
		
	Иначе
		
		Результат.ТекстОшибки = НСтр("ru = 'Для базы корреспондента не заданы поддерживаемые объекты'");
		Возврат Результат
		
	КонецЕсли;

	Результат.ПоддерживаемыеОбъекты = ПересечениеПоддерживаемыхОбъектов(ПоддерживаемыеОбъектыЭтойБазы, ПоддерживаемыеОбъектыБазыКорреспондента);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;

КонецФункции

// Определяет количество объектов, для которых настройки были установлены автоматически 
// 
// Параметры:
//  УзелПланаОбмена - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, для которого получаются данные.
// 
// Возвращаемое значение:
//  Булево, Число - Количество объектов настройки для которых установлены автоматически, Ложь, если при получении
//                  возникла ошибка.
//
Функция КоличествоОбъектовЗначенияУстановленыАвтоматически(УзелПланаОбмена) Экспорт
	
	РезультатПолучения = НастройкиПолученияОбъектовМетаданных(УзелПланаОбмена);
	
	Если Не РезультатПолучения.Успешно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("ЗначенияУстановленыАвтоматически", Истина);
	
	НайденныеСтроки = РезультатПолучения.НастройкиПолучения.НайтиСтроки(ПараметрыПоиска);
	
	Возврат НайденныеСтроки.Количество();
	
КонецФункции

#КонецОбласти

#Область ПолучениеДанных

// Выполняет отмену необходимости подтверждения и возвращает результаты отмены.
//  
// Параметры:
//  ТипыОбъектов           - Массив Из СправочникСсылка.ИдентификаторыОбъектовМетаданных - типы объектов, для которых
//                                                                                         выполняется операция
//  УзелИнформационнойБазы - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, для которого выполняется операция.
// 
// Возвращаемое значение:
//  Структура - Результат отмены необходимости подтверждения:
// * Успешно     - Булево  - признак успешности выполнения операции
// * ТекстОшибки - Строка  - текст ошибки если таковая возникла
// * КИзменению  - Число   - количество объектов к изменению
// * Изменено    - Число   - количество фактически измененных объектов
//
Функция РезультатОтменыНеобходимостиПодтверждения(ТипыОбъектов, УзелИнформационнойБазы) Экспорт

	РезультатОтмены = Новый Структура;
	РезультатОтмены.Вставить("Успешно",     Истина);
	РезультатОтмены.Вставить("ТекстОшибки", "");
	РезультатОтмены.Вставить("КИзменению",  0);
	РезультатОтмены.Вставить("Изменено",    0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИдентификаторыОбъектовМетаданных.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТипыОбъектов
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданных.Ссылка В (&ТипыОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТипыОбъектов.Ссылка КАК ТипОбъекта,
	|	ВЫБОР
	|		КОГДА ДействияПриПолученииДанныхОбмена.КакЗагружать ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		КОГДА ДействияПриПолученииДанныхОбмена.КакЗагружать = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПриПолученииДанныхОбмена.Автоматически)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Изменять
	|ИЗ
	|	ТипыОбъектов КАК ТипыОбъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействияПриПолученииДанныхОбмена КАК ДействияПриПолученииДанныхОбмена
	|		ПО (ТипыОбъектов.Ссылка = ДействияПриПолученииДанныхОбмена.ОбъектМетаданных
	|				И ДействияПриПолученииДанныхОбмена.УзелПланаОбмена = &УзелПланаОбмена)";
	
	Запрос.УстановитьПараметр("УзелПланаОбмена", УзелИнформационнойБазы);
	Запрос.УстановитьПараметр("ТипыОбъектов",    ТипыОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат РезультатОтмены;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		РезультатОтмены.КИзменению = РезультатОтмены.КИзменению + 1;
		
		Если Выборка.Изменять Тогда
			
			ДанныеИзменения = НовыйДанныеИзмененияЗаписиРегистра();
			ДанныеИзменения.УзелПланаОбмена  = УзелИнформационнойБазы;
			ДанныеИзменения.ОбъектМетаданных = Выборка.ТипОбъекта;
			ДанныеИзменения.КакЗагружать     = Перечисления.ВариантыДействийПриПолученииДанныхОбмена.Автоматически;
			
			ИзменитьЗаписьРегистра(ДанныеИзменения);
			
			РезультатОтмены.Изменено = РезультатОтмены.Изменено + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатОтмены;
	
КонецФункции

// Выполняет отмену необходимости поиска соответствий и возвращает результаты отмены.
//  
// Параметры:
//  ТипыОбъектов           - Массив Из СправочникСсылка.ИдентификаторыОбъектовМетаданных - типы объектов, для которых
//                                                                                         выполняется операция
//  УзелИнформационнойБазы - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, для которого выполняется операция.
// 
// Возвращаемое значение:
//  Структура - Результат отмены необходимости подтверждения:
// * Успешно     - Булево  - признак успешности выполнения операции
// * ТекстОшибки - Строка  - текст ошибки если таковая возникла
// * КИзменению  - Число   - количество объектов к изменению
// * Изменено    - Число   - количество фактически измененных объектов
//
Функция РезультатОтменыНеобходимостиПоискаСоответствий(ТипыОбъектов, УзелИнформационнойБазы) Экспорт
	
	РезультатОтмены = Новый Структура;
	РезультатОтмены.Вставить("Успешно",     Истина);
	РезультатОтмены.Вставить("ТекстОшибки", "");
	РезультатОтмены.Вставить("КИзменению",  0);
	РезультатОтмены.Вставить("Изменено",    0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИдентификаторыОбъектовМетаданных.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТипыОбъектов
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданных.Ссылка В (&ТипыОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТипыОбъектов.Ссылка КАК ТипОбъекта,
	|	ВЫБОР
	|		КОГДА ДействияПриПолученииДанныхОбмена.УстанавливатьСоответствия ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		КОГДА ДействияПриПолученииДанныхОбмена.УстанавливатьСоответствия <> ЗНАЧЕНИЕ(Перечисление.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных.Помощником)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Изменять
	|ИЗ
	|	ТипыОбъектов КАК ТипыОбъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействияПриПолученииДанныхОбмена КАК ДействияПриПолученииДанныхОбмена
	|		ПО (ТипыОбъектов.Ссылка = ДействияПриПолученииДанныхОбмена.ОбъектМетаданных
	|				И ДействияПриПолученииДанныхОбмена.УзелПланаОбмена = &УзелПланаОбмена)";
	
	Запрос.УстановитьПараметр("УзелПланаОбмена", УзелИнформационнойБазы);
	Запрос.УстановитьПараметр("ТипыОбъектов",    ТипыОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат РезультатОтмены;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		РезультатОтмены.КИзменению = РезультатОтмены.КИзменению + 1;
		
		Если Выборка.Изменять Тогда
			
			ДанныеИзменения = НовыйДанныеИзмененияЗаписиРегистра();
			ДанныеИзменения.УзелПланаОбмена           = УзелИнформационнойБазы;
			ДанныеИзменения.ОбъектМетаданных          = Выборка.ТипОбъекта;
			ДанныеИзменения.УстанавливатьСоответствия = Перечисления.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных.Автоматически;
			
			ИзменитьЗаписьРегистра(ДанныеИзменения);
			
			РезультатОтмены.Изменено = РезультатОтмены.Изменено + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатОтмены;
	
КонецФункции

#КонецОбласти

#Область СтратегииПоиска

// Процедура обновляет стратегию поиска, которая будет использоваться при поиски по ключам,
// в процессе загрузки данных (конвертации).
// 
// Параметры:
//   УзелСсылкаИлиИмяПланаОбмена - Неопределено - все планы обмена EnterpriseData,
//                                 Строка - имя плана обмена EnterpriseData,
//                                 Массив из Строка - массив с именами планов обмена EnterpriseData,
//                                 ПланОбменаСсылка - узел плана обмена, для которого необходимо обновить 
//                                                    стратегию поиска.
//
Процедура АктуализироватьСтратегииПоискаПоКлючам(УзелСсылкаИлиИмяПланаОбмена = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(УзелСсылкаИлиИмяПланаОбмена) Тогда
		
		ПланыОбменаБСП = ОбменДаннымиПовтИсп.ПланыОбменаБСП();
		
	ИначеЕсли ТипЗнч(УзелСсылкаИлиИмяПланаОбмена) = Тип("Строка") Тогда
		
		ПланыОбменаБСП = Новый Массив(1);
		ПланыОбменаБСП[0] = УзелСсылкаИлиИмяПланаОбмена;
		
	ИначеЕсли ТипЗнч(УзелСсылкаИлиИмяПланаОбмена) = Тип("Массив") Тогда
		
		ПланыОбменаБСП = УзелСсылкаИлиИмяПланаОбмена;
		
	ИначеЕсли ОбменДаннымиСервер.ЭтоПланОбменаXDTO(УзелСсылкаИлиИмяПланаОбмена) Тогда
		
		ЗаполнитьОбновитьСтратегииПоискаДанныхПоКлючам(УзелСсылкаИлиИмяПланаОбмена);
		Возврат;
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьОбновитьСтратегииПоискаПоПланамОбмена(ПланыОбменаБСП);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОпределениеСтратегийПоиска

Процедура ЗаполнитьОбновитьСтратегииПоискаПоПланамОбмена(ПланыОбменаБСП)
	
	ШаблонТекстаЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаПланаОбмена.Ссылка КАК Ссылка
	|ИЗ
	|	&ИмяТаблицыПланаОбмена КАК ТаблицаПланаОбмена
	|ГДЕ
	|	НЕ ТаблицаПланаОбмена.ЭтотУзел
	|	И НЕ ТаблицаПланаОбмена.ПометкаУдаления";
	
	ШаблонСекцииОбъединить =
	"
	|ОБЪЕДИНИТЬ ВСЕ
	|";
	
	Запрос = Новый Запрос;
	Для Каждого ИмяПланаОбмена Из ПланыОбменаБСП Цикл
		
		ИмяТаблицыПланаОбмена = СтрШаблон("ПланОбмена.%1", ИмяПланаОбмена);
		ТекстЗапросаДляПланаОбмена = СтрЗаменить(ШаблонТекстаЗапроса, "&ИмяТаблицыПланаОбмена", ИмяТаблицыПланаОбмена);
		
		Если ПустаяСтрока(Запрос.Текст) Тогда
			
			Запрос.Текст = ТекстЗапросаДляПланаОбмена;
			
		Иначе
			
			Запрос.Текст = Запрос.Текст + ШаблонСекцииОбъединить + ТекстЗапросаДляПланаОбмена;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		//@skip-check query-in-loop
		ЗаполнитьОбновитьСтратегииПоискаДанныхПоКлючам(Выборка.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьОбновитьСтратегииПоискаДанныхПоКлючам(УзелИнформационнойБазы, ОбъектМетаданных = Неопределено)
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.УзелПланаОбмена.Установить(УзелИнформационнойБазы, Истина);
	
	Если ОбъектМетаданных <> Неопределено Тогда
		
		Если ТипЗнч(ОбъектМетаданных) = Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных") Тогда
			
			НаборЗаписей.Отбор.ОбъектМетаданных.Установить(ОбъектМетаданных, Истина);
			
		Иначе
			
			ИОМ = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ОбъектМетаданных, Ложь);
			НаборЗаписей.Отбор.ОбъектМетаданных.Установить(ИОМ, Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
	НаборЗаписей.Прочитать();
	
	ИнтервалОбновления = КонвертацияОбъектноСлужебныйПовтИсп.ИнтервалОбновленияСтратегииПоискаПоКлючамПланаОбменаXDTO(УзелИнформационнойБазы);
	ИнтервалОбновленияВСекундах = ИнтервалОбновления * 86400;
	НаборНужноЗаписать = Ложь;
	
	Для Каждого ЗаписьНабора Из НаборЗаписей.ЭтотОбъект Цикл
		
		Если НЕ ЗначениеЗаполнено(ЗаписьНабора.ДатаОбновленияСтратегииПоиска)
			ИЛИ ЗаписьНабора.ДатаОбновленияСтратегииПоиска + ИнтервалОбновленияВСекундах < ТекущаяДатаСеанса() Тогда
			
			//@skip-check query-in-loop
			СвободныеЗаписи = КоличествоНесопоставленныхЭлементов(УзелИнформационнойБазы, ОбъектМетаданных);
			Если СвободныеЗаписи <= ГраницаИспользованияОптимальнойСтратегииПоискаПоКлючам() Тогда
				
				ЗаписьНабора.СтратегияПоискаПоКлючам = КонвертацияОбъектноСервер.ИдентификаторОптимальнойСтратегииПоискаПоКлючам();
				
			Иначе
				
				ЗаписьНабора.СтратегияПоискаПоКлючам = КонвертацияОбъектноСервер.ИдентификаторСтандартнойСтратегииПоискаПоКлючам();
				
			КонецЕсли;
			
			ЗаписьНабора.ДатаОбновленияСтратегииПоиска = ТекущаяДатаСеанса();
			НаборНужноЗаписать = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НаборНужноЗаписать = Истина Тогда
		
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ГраницаИспользованияОптимальнойСтратегииПоискаПоКлючам()
	
	Возврат КонвертацияОбъектноСервер.ГраницаИспользованияОптимальнойСтратегииПоискаПоКлючам();
	
КонецФункции

// Вычисление количества ссылок не имеющих записей в регистре ПубличныеИдентификаторыСинхронизируемыхОбъектов.
//
// Параметры:
//  УзелИнформационнойБазы - ПланОбменаСсылка - узел плана обмена EnterpriseData. 
//  ОбъектМетаданных - ОбъектМетаданных - объект метаданных, для которого выполняется вычисление количества ссылок
//                                        без сопоставления.
//
// Возвращаемое значение:
//   Число - Если в справочнике нет элементов, то вернем 0, т.к. в перспективе ожидаем появление первых...
// 
Функция КоличествоНесопоставленныхЭлементов(УзелИнформационнойБазы, ОбъектМетаданных)
	
	Если НЕ ЗначениеЗаполнено(УзелИнформационнойБазы)
		ИЛИ ОбъектМетаданных = Неопределено
		
		// В ПИСО нет соответствий для регистров
		ИЛИ ОбщегоНазначения.ЭтоРегистрСведений(ОбъектМетаданных)
		ИЛИ ОбщегоНазначения.ЭтоРегистрНакопления(ОбъектМетаданных)
		ИЛИ ОбщегоНазначения.ЭтоРегистрБухгалтерии(ОбъектМетаданных)
		ИЛИ ОбщегоНазначения.ЭтоРегистрРасчета(ОбъектМетаданных)
		Тогда
		
		// Используем стандартный поиск
		Возврат КонвертацияОбъектноСервер.ГраницаИспользованияОптимальнойСтратегииПоискаПоКлючам() + 1;
		
	КонецЕсли;
	
	ПолноеИмяОбъектаМетаданных = ОбъектМетаданных.ПолноеИмя();
	
	Возврат
		РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.КоличествоОбъектовБезСоответствия(
			ПолноеИмяОбъектаМетаданных,
			УзелИнформационнойБазы);
	
КонецФункции

#КонецОбласти

#Область Прочее

Функция НаборИЗаписьРегистра(ДанныеЗаписи)
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.УзелПланаОбмена.Установить(ДанныеЗаписи.УзелПланаОбмена);
	НаборЗаписей.Отбор.ОбъектМетаданных.Установить(ДанныеЗаписи.ОбъектМетаданных);
	
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		
		ЗаписьНабора = НаборЗаписей.Добавить();
		
	Иначе
		
		ЗаписьНабора = НаборЗаписей[0];
		
	КонецЕсли; 
	
	ДанныеРегистра = Новый Структура;
	ДанныеРегистра.Вставить("НаборЗаписей", НаборЗаписей);
	ДанныеРегистра.Вставить("ЗаписьНабора", ЗаписьНабора);
	
	Возврат ДанныеРегистра;
	
КонецФункции

Функция ТаблицаНастроекПолученияДанных(ДоступныеКЗагрузкеОбъектыМетаданных, УзелПланаОбмена) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДоступныеКЗагрузкеОбъектыМетаданных.ОбъектМетаданных               КАК ОбъектМетаданных,
	|	ДоступныеКЗагрузкеОбъектыМетаданных.ИмяТипаМетаданных              КАК ИмяТипаМетаданных,
	|	ДоступныеКЗагрузкеОбъектыМетаданных.ПредставлениеТипаМетаданных    КАК ПредставлениеТипаМетаданных,
	|	ДоступныеКЗагрузкеОбъектыМетаданных.Синоним                        КАК Синоним,
	|	ДоступныеКЗагрузкеОбъектыМетаданных.ПолноеИмя                      КАК ПолноеИмя,
	|	ДоступныеКЗагрузкеОбъектыМетаданных.ПредставлениеОбъектаМетаданных КАК ПредставлениеОбъектаМетаданных
	|ПОМЕСТИТЬ ДоступныеКЗагрузкеОбъектыМетаданных
	|ИЗ
	|	&ДоступныеКЗагрузкеОбъектыМетаданных КАК ДоступныеКЗагрузкеОбъектыМетаданных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////1
	|
	|ВЫБРАТЬ
	|	ДействияПриПолученииДанныхОбмена.Загружать                            КАК Загружать,
	|	ДействияПриПолученииДанныхОбмена.КакЗагружать                         КАК КакЗагружать,
	|	ДействияПриПолученииДанныхОбмена.УстанавливатьСоответствия            КАК УстанавливатьСоответствия,
	|	ДействияПриПолученииДанныхОбмена.ЗначенияУстановленыАвтоматически     КАК ЗначенияУстановленыАвтоматически,
	|	ДействияПриПолученииДанныхОбмена.СтратегияПоискаПоКлючам              КАК СтратегияПоискаПоКлючам,
	|	ДействияПриПолученииДанныхОбмена.ОбъектМетаданных                     КАК ОбъектМетаданных,
	|	ДействияПриПолученииДанныхОбмена.Загружать                            КАК Комментарий,
	|	&УзелПланаОбмена                                                      КАК УзелПланаОбмена
	|ПОМЕСТИТЬ ДействияПриПолученииДанныхОбмена
	|ИЗ
	| РегистрСведений.ДействияПриПолученииДанныхОбмена КАК ДействияПриПолученииДанныхОбмена
	|ГДЕ
	|	ДействияПриПолученииДанныхОбмена.УзелПланаОбмена = &УзелПланаОбмена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////2
	|ВЫБРАТЬ
	|	ДоступныеКЗагрузкеОбъектыМетаданных.ОбъектМетаданных                                КАК ОбъектМетаданных,
	|	ДоступныеКЗагрузкеОбъектыМетаданных.ПредставлениеТипаМетаданных                     КАК ПредставлениеТипаМетаданных,
	|	ДоступныеКЗагрузкеОбъектыМетаданных.ИмяТипаМетаданных                               КАК ИмяТипаМетаданных,
	|	ДоступныеКЗагрузкеОбъектыМетаданных.ПредставлениеОбъектаМетаданных                  КАК ПредставлениеОбъектаМетаданных,
	|	ДоступныеКЗагрузкеОбъектыМетаданных.Синоним                                         КАК Синоним,
	|	ДоступныеКЗагрузкеОбъектыМетаданных.ПолноеИмя                                       КАК ПолноеИмя,
	|	ЕСТЬNULL(ДействияПриПолученииДанныхОбмена.Загружать, ИСТИНА)                        КАК Загружать,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДействияПриПолученииДанныхОбмена.УстанавливатьСоответствия, ЗНАЧЕНИЕ(Перечисление.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных.Помощником)) = ЗНАЧЕНИЕ(Перечисление.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ЕСТЬNULL(ДействияПриПолученииДанныхОбмена.УстанавливатьСоответствия, НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ                                                                               КАК УстанавливатьСоответствия,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДействияПриПолученииДанныхОбмена.КакЗагружать, ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПриПолученииДанныхОбмена.Автоматически)) = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПриПолученииДанныхОбмена.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПриПолученииДанныхОбмена.Автоматически)
	|		ИНАЧЕ ЕСТЬNULL(ДействияПриПолученииДанныхОбмена.КакЗагружать, ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПриПолученииДанныхОбмена.Автоматически))
	|	КОНЕЦ                                                                               КАК КакЗагружать,
	|	ЕСТЬNULL(ДействияПриПолученииДанныхОбмена.Комментарий, """")                        КАК Комментарий,
	|	ЕСТЬNULL(ДействияПриПолученииДанныхОбмена.ЗначенияУстановленыАвтоматически, ИСТИНА) КАК ЗначенияУстановленыАвтоматически,
	|	ИдентификаторыОбъектовМетаданных.ЗначениеПустойСсылки                               КАК ЗначениеПустойСсылки,
	|	ДействияПриПолученииДанныхОбмена.СтратегияПоискаПоКлючам                            КАК СтратегияПоискаПоКлючам
	|ИЗ
	|	ДоступныеКЗагрузкеОбъектыМетаданных КАК ДоступныеКЗагрузкеОбъектыМетаданных
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДействияПриПолученииДанныхОбмена КАК ДействияПриПолученииДанныхОбмена
	|			ПО ДоступныеКЗагрузкеОбъектыМетаданных.ОбъектМетаданных = ДействияПриПолученииДанныхОбмена.ОбъектМетаданных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|			ПО ДоступныеКЗагрузкеОбъектыМетаданных.ОбъектМетаданных = ИдентификаторыОбъектовМетаданных.Ссылка
	|ГДЕ 
	|	ИдентификаторыОбъектовМетаданных.ЗначениеПустойСсылки <> Неопределено";
	
	Запрос.УстановитьПараметр("ДоступныеКЗагрузкеОбъектыМетаданных", ДоступныеКЗагрузкеОбъектыМетаданных);
	Запрос.УстановитьПараметр("УзелПланаОбмена",                     УзелПланаОбмена);
	
	ТаблицаДействий = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаДействий Цикл
		
		Если СтрокаТаблицы.УстанавливатьСоответствия = Неопределено Тогда
			
			Если ОбщегоНазначения.ЭтоДокумент(СтрокаТаблицы.ЗначениеПустойСсылки.Метаданные()) Тогда
				
				СтрокаТаблицы.УстанавливатьСоответствия = Перечисления.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных.Автоматически;
				
			Иначе
				
				СтрокаТаблицы.УстанавливатьСоответствия = Перечисления.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных.Помощником;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаДействий;
	
КонецФункции

Функция ПересечениеПоддерживаемыхОбъектов(ОбъектыПолучения, ОбъектыОтправки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ОбъектыПолучения.Объект КАК СТРОКА(200)) КАК Объект
		|ПОМЕСТИТЬ ОбъектыПолучения
		|ИЗ
		|	&ОбъектыПолучения КАК ОбъектыПолучения
		|ГДЕ
		|	ОбъектыПолучения.Получение
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ОбъектыОтправки.Объект КАК СТРОКА(200)) КАК Объект
		|ПОМЕСТИТЬ ОбъектыОтправки
		|ИЗ
		|	&ОбъектыОтправки КАК ОбъектыОтправки
		|ГДЕ
		|	ОбъектыОтправки.Отправка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ОбъектыОтправки.Объект, """") КАК Объект
		|ИЗ
		|	ОбъектыПолучения КАК ОбъектыПолучения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъектыОтправки КАК ОбъектыОтправки
		|		ПО ОбъектыПолучения.Объект = ОбъектыОтправки.Объект
		|ГДЕ
		|	НЕ ОбъектыОтправки.Объект ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ОбъектыПолучения",ОбъектыПолучения);
	Запрос.УстановитьПараметр("ОбъектыОтправки",ОбъектыОтправки);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Результат = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(СокрЛП(Выборка.Объект), Новый Массив);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получает настройки действий при получении обмена для всех объектов
// 
// Параметры:
//  УзелПланаОбмена    - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, для которого определяются действия при получении. 
// 
// Возвращаемое значение:
//  Структура - Действия обмена:
// * Успешно - Булево - признак того что поддерживаемые объекты формата определены успешно
// * ТекстОшибки - Строка - текст ошибки, если таковая возникла.
// * УзелПланаОбмена - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, для которого были определены действия при получении.
// * НастройкиПолучения - Неопределено,ТаблицаЗначений  - содержит:
//  ** ИмяТипаМетаданных - Строка        - как оно задано при обращении к типу метаданных из кода, например
//                                         "Справочники", "РегистрыСведений"
//  ** ПредставлениеТипаМетаданных       - Строка - представление типа метаданных, например "Регистры сведений"
//  ** ПредставлениеОбъектаМетаданных    - Строка - строка в формате "ИмяОбъектаМетаданных (ИмяТипаМетаданных)",
//                                                  например "Страны (Справочник)"
//  ** ПолноеИмя                         - Строка - совпадает с результатом, который возвращает функция ОбъектМетаданных.ПолноеИмя()
//  ** Синоним                           - Строка - синоним объекта метаданных
//  ** Загружать                         - Булево - признак того что загрузка объекта доступна.
//  ** КакЗагружать                      - ПеречислениеСсылка.ВариантыДействийПриПолученииДанныхОбмена  - как загружать
//      новые объекты данного типа
//  ** УстанавливатьСоответствия         -
//      ПеречислениеСсылка.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных - требуется ли установка соответствия
//  ** ЗначенияУстановленыАвтоматически  - Булево - признак того, что значения настройки были установлены автоматически
//  ** Комментарий                       - Строка - произвольный комментарий
//  ** СтратегияПоискаПоКлючам           - Строка - стратегия поиска по ключевым полям
//
Функция ДействияОбмена(УзелПланаОбмена)
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно",            Ложь);
	Результат.Вставить("ТекстОшибки",        "");
	Результат.Вставить("НастройкиПолучения", Неопределено);
	Результат.Вставить("УзелПланаОбмена",    УзелПланаОбмена);
	
	РезультатОпределенияПоддерживаемыхОбъектов = ОбменДаннымиПовтИсп.ПоддерживаемыеОбъектыФормата(УзелПланаОбмена);
	
	Если Не РезультатОпределенияПоддерживаемыхОбъектов.Успешно Тогда
		
		Результат.ТекстОшибки = РезультатОпределенияПоддерживаемыхОбъектов.ТекстОшибки;
		Возврат Результат;
		
	КонецЕсли;
	
	РезультатОпределенияДоступныхОбъектов = ОбменДаннымиПовтИсп.ДоступныеДляПолученияОбъектыМетаданных(УзелПланаОбмена);
	Если Не РезультатОпределенияДоступныхОбъектов.Успешно Тогда
		
		Результат.ТекстОшибки = РезультатОпределенияДоступныхОбъектов.ТекстОшибки;
		Возврат Результат;
		
	КонецЕсли;
	
	Результат.НастройкиПолучения = ТаблицаНастроекПолученияДанных(РезультатОпределенияДоступныхОбъектов.ДоступныеОбъекты, УзелПланаОбмена);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

// Получает таблицу доступных к загрузке объектов метаданных.
// 
// Параметры:
//  ПоддерживаемыеОбъектыФормата - Соответствие из Строка - см.ПоддерживаемыеОбъектыФормата
// 	УзелПланаОбмена              - ПланОбменаСсылкаИмяПланаОбмена - узел плана обмена, для которого определяются доступные к загрузке объекты метаданных. 
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица доступных к загрузке объектов метаданных, содержит:
//   * ОбъектМетаданных               - СправочникСсылка.ИдентификаторыОбъектовМетаданных -
//   * Синоним                        - Строка - синоним объекта метаданных
//   * ПолноеИмя                      - Строка - полное имя объекта метаданных
//   * ПредставлениеОбъектаМетаданных - Строка - 
//   * ИмяТипаМетаданных              - Строка - например Справочник или ПланВидовХарактеристик
//   * ПредставлениеТипаМетаданных    - Строка - представление типа
//
Функция ТаблицаДоступныхКЗагрузкеОбъектовМетаданных(ПоддерживаемыеОбъектыФормата, УзелПланаОбмена)
	
	ВерсияФорматаОбмена        = УзелПланаОбмена.ВерсияФорматаОбмена;
	МенеджераОбмена            = ОбменДаннымиXDTOСервер.МенеджерОбменаВерсииФормата(ВерсияФорматаОбмена, УзелПланаОбмена);
	КоллекцияПравилКонвертации = ОбменДаннымиПовтИсп.ТаблицаПравилКонвертации(МенеджераОбмена.ВерсияФорматаМенеджераОбмена(), ВерсияФорматаОбмена, Истина);
	
	Для Каждого ПравилоКонвертации Из КоллекцияПравилКонвертации Цикл
		
		ПоддерживаемыйОбъектФормата = ПоддерживаемыеОбъектыФормата.Получить(ПравилоКонвертации.ОбъектФормата);
		
		Если ПоддерживаемыйОбъектФормата = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПоддерживаемыйОбъектФормата.Добавить(ПравилоКонвертации.ОбъектДанных);
		
	КонецЦикла;
	
	МассивПолныхИменОбъектовМетаданных = Новый Массив;
	ОбъектыФорматаСПравилами           = Новый Соответствие;
	
	Для Каждого КлючИЗначение Из ПоддерживаемыеОбъектыФормата Цикл
		
		Если КлючИЗначение.Значение.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ОбъектМетаданных Из КлючИЗначение.Значение Цикл
			
			МассивПолныхИменОбъектовМетаданных.Добавить(ОбъектМетаданных.ПолноеИмя());
			
		КонецЦикла;
		
		ОбъектыФорматаСПравилами.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИдентификаторыОбъектовМетаданных.Ссылка               КАК ОбъектМетаданных,
	|	ИдентификаторыОбъектовМетаданных.Синоним              КАК Синоним,
	|	ИдентификаторыОбъектовМетаданных.ПолноеИмя            КАК ПолноеИмя,
	|	ИдентификаторыОбъектовМетаданных.Представление        КАК ПредставлениеОбъектаМетаданных,
	|	ИдентификаторыОбъектовМетаданныхРодители.Имя          КАК ИмяТипаМетаданных,
	|	ИдентификаторыОбъектовМетаданныхРодители.Синоним      КАК ПредставлениеТипаМетаданных
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданныхРодители
	|		ПО ИдентификаторыОбъектовМетаданных.Родитель = ИдентификаторыОбъектовМетаданныхРодители.Ссылка
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданных.ПолноеИмя В(&МассивПолныхИменМетаданных)";
	
	Запрос.УстановитьПараметр("МассивПолныхИменМетаданных", МассивПолныхИменОбъектовМетаданных);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Заполняет таблицу поддерживаемых объектов с типами для дальнейшего использования в запросе.
// 
// Параметры:
//  ИсходнаяТаблица - ТаблицаЗначений - Исходная таблица с поддерживаемыми объектами
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица поддерживаемых объектов с заполненными типами 
//
Функция ТаблицаПоддерживаемыхОбъектовФорматаСТипами(ИсходнаяТаблица)
	
	ТаблицаПоддерживаемыхОбъектов = Новый ТаблицаЗначений;
	
	ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуПоддерживаемыхОбъектовФормата(ТаблицаПоддерживаемыхОбъектов, "ОтправкаПолучение", Ложь);
	
	Для Каждого Строка Из ИсходнаяТаблица Цикл
		
		ЗаполнитьЗначенияСвойств(ТаблицаПоддерживаемыхОбъектов.Добавить(), Строка);
		
	КонецЦикла;
	
	Возврат ТаблицаПоддерживаемыхОбъектов;
	
КонецФункции


// Проверяет типы в колонках таблицы значений
// 
// Параметры:
//  Таблица -ТаблицаЗначений - Таблица
// 
// Возвращаемое значение:
//  Булево - Есть колонки таблицы без описания типов
//
Функция ЕстьКолонкиТаблицыБезОписанияТипов(Таблица)
	
	ЕстьКолонкиБезТиповЗначений = Ложь;
	
	Для Каждого Колонка Из Таблица.Колонки Цикл
		
		Если Не ЗначениеЗаполнено(Колонка.ТипЗначения) Тогда
			
			ЕстьКолонкиБезТиповЗначений = Истина;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЕстьКолонкиБезТиповЗначений
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
